nvitya/vihal/rv32i/ESP/32C6/esp32c6_vihal.h
#define IO_MUX     ((esp_io_mux_t *)(DR_REG_IO_MUX_BASE))
#define GPIO         ((esp_gpio_t *)(DR_REG_GPIO_BASE))

//-----------------------------------------------------------------------------
// SYSTEM
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t      CPU_PERI_CLK_EN;    // 0000
  volatile uint32_t      CPU_PERI_RST_EN;    // 0004
  volatile uint32_t      CPU_PER_CONF;       // 0008
  uint32_t               _pad_000C;
  volatile uint32_t      PERIP_CLK_EN0;      // 0010
  volatile uint32_t      PERIP_CLK_EN1;      // 0014
  volatile uint32_t      PERIP_RST_EN0;      // 0018
  volatile uint32_t      PERIP_RST_EN1;      // 001C
  uint32_t               _pad_0020;
  volatile uint32_t      BT_LPCK_DIV_FRAC;   // 0024
  volatile uint32_t      CPU_INTR_FROM_CPU_0;// 0028
  volatile uint32_t      CPU_INTR_FROM_CPU_1;// 002C
  volatile uint32_t      CPU_INTR_FROM_CPU_2;// 0030
  volatile uint32_t      CPU_INTR_FROM_CPU_3;// 0034
  volatile uint32_t      RSA_PD_CTRL;        // 0038
  uint32_t               _pad_003C;
  volatile uint32_t      CACHE_CONTROL;      // 0040
  volatile uint32_t      EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROLLER;      // 0044
  volatile uint32_t      RTC_FASTMEM_CONFIG; // 0048
  volatile uint32_t      RTC_FASTMEM_CRC;    // 004C
  uint32_t               _pad_0050;
  volatile uint32_t      CLOCK_GATE;         // 0054
  volatile uint32_t      SYSCLK_CONF;        // 0058
//
} esp_sysreg_t;

#if 1
  // definition check:

  static_assert(offsetof(esp_sysreg_t, BT_LPCK_DIV_FRAC)    == 0x024, "offset error");
  static_assert(offsetof(esp_sysreg_t, CLOCK_GATE)          == 0x054, "offset error");
#endif


typedef struct
{
  uint32_t               _pad_0000[41];
  volatile uint32_t      CLKGATE_FORCE_ON;   // 00A4
  volatile uint32_t      MEM_POWER_DOWN;     // 00A8
  volatile uint32_t      MEM_POWER_UP;       // 00AC
//
} esp_apb_ctrl_t;


#define SYSTEM      ((esp_sysreg_t *)(0x600C0000))
#define APB_CTRL  ((esp_apb_ctrl_t *)(0x60026000))

//-----------------------------------------------------------------------------
// RTC
//-----------------------------------------------------------------------------
typedef struct
{
  volatile uint32_t      OPTIONS0;            // 0000
  volatile uint32_t      SLP_TIMER0;          // 0004
  volatile uint32_t      SLP_TIMER1;          // 0008
  volatile uint32_t      TIME_UPDATE;         // 000C
  volatile uint32_t      TIME_LOW0;           // 0010
  volatile uint32_t      TIME_HIGH0;          // 0014
  volatile uint32_t      STATE0;              // 0018
  volatile uint32_t      TIMER1;              // 001C
  volatile uint32_t      TIMER2;              // 0020
  volatile uint32_t      TIMER3;              // 0024
  volatile uint32_t      TIMER4;              // 0028
  volatile uint32_t      TIMER5;              // 002C
  volatile uint32_t      TIMER6;              // 0030
  volatile uint32_t      ANA_CONF;            // 0034
  volatile uint32_t      RESET_STATE;         // 0038
  volatile uint32_t      WAKEUP_STATE;        // 003C
  volatile uint32_t      INT_ENA;             // 0040
  volatile uint32_t      INT_RAW;             // 0044
  volatile uint32_t      INT_ST;              // 0048
  volatile uint32_t      INT_CLR;             // 004C
  volatile uint32_t      STORE0;              // 0050
  volatile uint32_t      STORE1;              // 0054
  volatile uint32_t      STORE2;              // 0058
  volatile uint32_t      STORE3;              // 005C
  volatile uint32_t      EXT_XTL_CONF;        // 0060
  volatile uint32_t      EXT_WAKEUP_CONF;     // 0064
  volatile uint32_t      SLP_REJECT_CONF;     // 0068
  volatile uint32_t      CPU_PERIOD_CONF;     // 006C
  volatile uint32_t      CLK_CONF;            // 0070
  volatile uint32_t      SLOW_CLK_CONF;       // 0074
  volatile uint32_t      SDIO_CONF;           // 0078
  volatile uint32_t      BIAS_CONF;           // 007C
  volatile uint32_t      REG;                 // 0080
  volatile uint32_t      PWC;                 // 0084
  volatile uint32_t      DIG_PWC;             // 0088
  volatile uint32_t      DIG_ISO;             // 008C
  volatile uint32_t      WDTCONFIG0;          // 0090
  volatile uint32_t      WDTCONFIG1;          // 0094
  volatile uint32_t      WDTCONFIG2;          // 0098
  volatile uint32_t      WDTCONFIG3;          // 009C
  volatile uint32_t      WDTCONFIG4;          // 00A0
  volatile uint32_t      WDTFEED;             // 00A4
  volatile uint32_t      WDTWPROTECT;         // 00A8
  volatile uint32_t      SWD_CONF;            // 00AC
  volatile uint32_t      SWD_WPROTECT;        // 00B0
  volatile uint32_t      SW_CPU_STALL;        // 00B4
  volatile uint32_t      STORE4;              // 00B8
  volatile uint32_t      STORE5;              // 00BC
  volatile uint32_t      STORE6;              // 00C0
  volatile uint32_t      STORE7;              // 00C4
  volatile uint32_t      LOW_POWER_ST;        // 00C8
  volatile uint32_t      DIAG0;               // 00CC
  volatile uint32_t      PAD_HOLD;            // 00D0
  volatile uint32_t      DIG_PAD_HOLD;        // 00D4
  volatile uint32_t      BROWN_OUT;           // 00D8
  volatile uint32_t      TIME_LOW1;           // 00DC
  volatile uint32_t      TIME_HIGH1;          // 00E0
  volatile uint32_t      XTAL32K_CLK_FACTOR;  // 00E4
  volatile uint32_t      XTAL32K_CONF;        // 00E8
  volatile uint32_t      USB_CONF;            // 00EC
  volatile uint32_t      SLP_REJECT_CAUSE;    // 00F0
  volatile uint32_t      OPTION1;             // 00F4
  volatile uint32_t      SLP_WAKEUP_CAUSE;    // 00F8
  volatile uint32_t      ULP_CP_TIMER_1;      // 00FC
  volatile uint32_t      INT_ENA_W1TS;        // 0100
  volatile uint32_t      INT_ENA_W1TC;        // 0104
  volatile uint32_t      RETENTION_CTRL;      // 0108
  volatile uint32_t      FIB_SEL;             // 010C
  volatile uint32_t      GPIO_WAKEUP;         // 0110
  volatile uint32_t      DBG_SEL;             // 0114
  volatile uint32_t      DBG_MAP;             // 0118
  volatile uint32_t      SENSOR_CTRL;         // 011C
  volatile uint32_t      DBG_SAR_SEL;         // 0120
  volatile uint32_t      PG_CTRL;             // 0124
  uint32_t               _pad_128[53];        // 0128

