nvitya/vihal/rv32i/ESP/32C6/esp32c6_vihal.h
  volatile uint32_t      DATE;                // 01fc
//
} esp_rtc_cntl_t;

#define RTC_CNTL  ((esp_rtc_cntl_t *)(0x60008000))

//-----------------------------------------------------------------------------
// SYSTIMER
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  HI;
  volatile uint32_t  LO;
//
} esp_systimer_reg64_t;

typedef struct
{
  volatile uint32_t     CONF;           // 000
  volatile uint32_t     OP[2];          // 004 - 008
  esp_systimer_reg64_t  LOAD_VAL[2];    // 00C - 018
  esp_systimer_reg64_t  TARGET_VAL[3];  //
  volatile uint32_t     TARGET_CONF[3]; //
  esp_systimer_reg64_t  UNIT_VALUE[2];  //

  volatile uint32_t     COMP_LOAD[3];
  volatile uint32_t     UNIT_LOAD[2];
  volatile uint32_t     INT_ENA;
  volatile uint32_t     INT_RAW;
  volatile uint32_t     INT_CLR;
  volatile uint32_t     INT_ST;         // 070

  uint32_t              _pad_074[34];
  volatile uint32_t     DATE;           // 0FC
//
} esp_systimer_t;

#define SYS_TIMER ((esp_systimer_t *)(DR_REG_SYSTIMER_BASE))

//-----------------------------------------------------------------------------
// Timer Group (TIMG0-1)
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t     T0CONFIG;        // 0x0000
  volatile uint32_t     T0LO;            // 0x0004
  volatile uint32_t     T0HI;            // 0x0008
  volatile uint32_t     T0UPDATE;        // 0x000c
  volatile uint32_t     T0ALARMLO;       // 0x0010
  volatile uint32_t     T0ALARMHI;       // 0x0014
  volatile uint32_t     T0LOADLO;        // 0x0018
  volatile uint32_t     T0LOADHI;        // 0x001c
  volatile uint32_t     T0LOAD;          // 0x0020
  uint32_t              _pad_0024[9];    //     24
  volatile uint32_t     WDTCONFIG0;      // 0x0048
  volatile uint32_t     WDTCONFIG1;      // 0x004c
  volatile uint32_t     WDTCONFIG2;      // 0x0050
  volatile uint32_t     WDTCONFIG3;      // 0x0054
  volatile uint32_t     WDTCONFIG4;      // 0x0058
  volatile uint32_t     WDTCONFIG5;      // 0x005c
  volatile uint32_t     WDTFEED;         // 0x0060
  volatile uint32_t     WDTWPROTECT;     // 0x0064
  volatile uint32_t     RTCCALICFG;      // 0x0068
  volatile uint32_t     RTCCALICFG1;     // 0x006c
  volatile uint32_t     INT_ENA_TIMERS;  // 0x0070
  volatile uint32_t     INT_RAW_TIMERS;  // 0x0074
  volatile uint32_t     INT_ST_TIMERS;   // 0x0078
  volatile uint32_t     INT_CLR_TIMERS;  // 0x007c
  volatile uint32_t     RTCCALICFG2;     // 0x0080
  uint32_t              _pad_0084[29];   //     84
  volatile uint32_t     NTIMERS_DATE;    // 0x00f8
  volatile uint32_t     CLK;             // 0x00fc
//
} esp_timg_t;

#define TIMG0  ((esp_timg_t *)(DR_REG_TIMERGROUP0_BASE))
#define TIMG1  ((esp_timg_t *)(DR_REG_TIMERGROUP1_BASE))

//-----------------------------------------------------------------------------
// UART
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  FIFO;            // 0000
  volatile uint32_t  INT_RAW;         // 0004
  volatile uint32_t  INT_ST;          // 0008
  volatile uint32_t  INT_ENA;         // 000C
  volatile uint32_t  INT_CLR;         // 0010
  volatile uint32_t  CLKDIV;          // 0014
  volatile uint32_t  RX_FILT;         // 0018
  volatile uint32_t  STATUS;          // 001C
  volatile uint32_t  CONF0;           // 0020
  volatile uint32_t  CONF1;           // 0024
  volatile uint32_t  LOWPULSE;        // 0028
  volatile uint32_t  HIGHPULSE;       // 002C
  volatile uint32_t  RXD_CNT;         // 0030
  volatile uint32_t  FLOW_CONF;       // 0034
  volatile uint32_t  SLEEP_CONF;      // 0038
  volatile uint32_t  SWFC_CONF0;      // 003C
  volatile uint32_t  SWFC_CONF1;      // 0040
  volatile uint32_t  TXBRK_CONF;      // 0044
  volatile uint32_t  IDLE_CONF;       // 0048
  volatile uint32_t  RS485_CONF;      // 004C
  volatile uint32_t  AT_CMD_PRECNT;   // 0050
  volatile uint32_t  AT_CMD_POSTCNT;  // 0054
  volatile uint32_t  AT_CMD_GAPTOUT;  // 0058
  volatile uint32_t  AT_CMD_CHAR;     // 005C
  volatile uint32_t  MEM_CONF;        // 0060
  volatile uint32_t  MEM_TX_STATUS;   // 0064
  volatile uint32_t  MEM_RX_STATUS;   // 0068
  volatile uint32_t  FSM_STATUS;      // 006C
  volatile uint32_t  POSPULSE;        // 0070
  volatile uint32_t  NEGPULSE;        // 0074
  volatile uint32_t  CLK_CONF;        // 0078
  volatile uint32_t  DATE;            // 007C
  volatile uint32_t  ID;              // 0080
//
} esp_uart_t;

typedef struct
{
  volatile uint32_t  WORD[2];
//
} esp_uhci_reg_q_t;

typedef struct
{
  volatile uint32_t  CONF0;         // 0000
  volatile uint32_t  INT_RAW;       // 0004
  volatile uint32_t  INT_ST;        // 0008
  volatile uint32_t  INT_ENA;       // 000C
  volatile uint32_t  INT_CLR;       // 0010
  volatile uint32_t  CONF1;         // 0014
  volatile uint32_t  STATE0;        // 0018
  volatile uint32_t  STATE1;        // 001C
  volatile uint32_t  ESCAPE_CONF;   // 0020
  volatile uint32_t  HUNG_CONF;     // 0024
  volatile uint32_t  ACK_NUM;       // 0028
  volatile uint32_t  RX_HEAD;       // 002C
  volatile uint32_t  QUICK_SENT;    // 0030
  esp_uhci_reg_q_t   REG_Q[6];      // 0034
  volatile uint32_t  ESC_CONF[4];   // 006C
  volatile uint32_t  PKT_THRES;     // 007C
  volatile uint32_t  DATE;          // 0080
//
} esp_uhci_t;

#define UART0     ((esp_uart_t *)(DR_REG_UART_BASE))
#define UART1     ((esp_uart_t *)(DR_REG_UART1_BASE))

#define UHCI0     ((esp_uhci_t *)(DR_REG_UHCI0_BASE))

//-----------------------------------------------------------------------------
// SPI, applies only to SPI2
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t CMD;          // 0x00
  volatile uint32_t ADDR;         // 0x04
  volatile uint32_t CTRL;         // 0x08
  volatile uint32_t CLOCK;        // 0x0C
  volatile uint32_t USER;         // 0x10
  volatile uint32_t USER1;        // 0x14
  volatile uint32_t USER2;        // 0x18
  volatile uint32_t MS_DLEN;      // 0x1C
  volatile uint32_t MISC;         // 0x20
  volatile uint32_t DIN_MODE;     // 0x24
  volatile uint32_t DIN_NUM;      // 0x28
  volatile uint32_t DOUT_MODE;    // 0x2C
  volatile uint32_t DMA_CONF;     // 0x30
  volatile uint32_t DMA_INT_ENA;  // 0x34
  volatile uint32_t DMA_INT_CLR;  // 0x38
  volatile uint32_t DMA_INT_RAW;  // 0x3C
  volatile uint32_t DMA_INT_ST;   // 0x40
           uint32_t _pad_44[(0x98-0x44) / 4];
  volatile uint32_t W[16];        // 0x98 .. 0xD4
           uint32_t _pad_D8;
           uint32_t _pad_DC;
  volatile uint32_t SLAVE;        // 0xE0
  volatile uint32_t SLAVE1;       // 0xE4
  volatile uint32_t CLK_GATE;     // 0xE8
           uint32_t _pad_EC;
  volatile uint32_t DATE;         // 0xF0
//
} esp_spi_t;

#define SPI2     ((esp_spi_t *)(DR_REG_SPI2_BASE))

