nvitya/vihal/rv32i/ESP/32C6/esp32c6_vihal.h
//-----------------------------------------------------------------------------
// SPI MEM = SPI1, non-documented, extracted from the register definitions
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t CMD;               // 0x000
  volatile uint32_t ADDR;              // 0x004
  volatile uint32_t CTRL;              // 0x008
  volatile uint32_t CTRL1;             // 0x00C
  volatile uint32_t CTRL2;             // 0x010
  volatile uint32_t CLOCK;             // 0x014
  volatile uint32_t USER;              // 0x018
  volatile uint32_t USER1;             // 0x01C
  volatile uint32_t USER2;             // 0x020
  volatile uint32_t MOSI_DLEN;         // 0x024
  volatile uint32_t MISO_DLEN;         // 0x028
  volatile uint32_t RD_STATUS;         // 0x02C
           uint32_t _pad_030;          // 0x030
  volatile uint32_t MISC;              // 0x034
  volatile uint32_t TX_CRC;            // 0x038
  volatile uint32_t CACHE_FCTRL;       // 0x03C
           uint32_t _pad_040[(0x54-0x40) / 4];
  volatile uint32_t FSM;               // 0x054
  volatile uint32_t W[16];             // 0x058 .. 0x094
  volatile uint32_t FLASH_WAITI_CTRL;  // 0x098
  volatile uint32_t FLASH_SUS_CTRL;    // 0x09C
  volatile uint32_t FLASH_SUS_CMD;     // 0x0A0
  volatile uint32_t SUS_STATUS;        // 0x0A4
  volatile uint32_t TIMING_CALI;       // 0x0A8
  volatile uint32_t DIN_MODE;          // 0x0AC
  volatile uint32_t DIN_NUM;           // 0x0B0
  volatile uint32_t DOUT_MODE;         // 0x0B4
           uint32_t _pad_0B8[2];
  volatile uint32_t INT_ENA;           // 0x0C0
  volatile uint32_t INT_CLR;           // 0x0C4
  volatile uint32_t INT_RAW;           // 0x0C8
  volatile uint32_t INT_ST;            // 0x0CC
           uint32_t _pad_0D0[3];
  volatile uint32_t CLOCK_GATE;        // 0x0DC
  volatile uint32_t CORE_CLK_SEL;      // 0x0E0
           uint32_t _pad_0E4[(0x3FC-0x0E4) / 4];
  volatile uint32_t DATE;              // 0x3FC
//
} esp_spi_mem_t;

#if 1
  // definition check:

  static_assert(offsetof(esp_spi_mem_t, CLOCK_GATE)      == 0x0DC, "offset error");
  static_assert(offsetof(esp_spi_mem_t, CORE_CLK_SEL)    == 0x0E0, "offset error");
#endif

#define SPIMEM0   ((esp_spi_mem_t *)(DR_REG_SPI0_BASE))
#define SPIMEM1   ((esp_spi_mem_t *)(DR_REG_SPI1_BASE))

//-----------------------------------------------------------------------------
// USB SERIAL JTAG
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  EP1;         // 0x00
  volatile uint32_t  EP1_CONF;    // 0x04
  volatile uint32_t  INT_RAW;     // 0x08
  volatile uint32_t  INT_ST;      // 0x0c
  volatile uint32_t  INT_ENA;     // 0x10
  volatile uint32_t  INT_CLR;     // 0x14
  volatile uint32_t  CONF0;       // 0x18
  volatile uint32_t  TEST;        // 0x1c
  volatile uint32_t  JFIFO_ST;    // 0x20
  volatile uint32_t  FRAM_NUM;    // 0x24
  volatile uint32_t  IN_EP0_ST;   // 0x28
  volatile uint32_t  IN_EP1_ST;   // 0x2c
  volatile uint32_t  IN_EP2_ST;   // 0x30
  volatile uint32_t  IN_EP3_ST;   // 0x34
  volatile uint32_t  OUT_EP0_ST;  // 0x38
  volatile uint32_t  OUT_EP1_ST;  // 0x3c
  volatile uint32_t  OUT_EP2_ST;  // 0x40
  volatile uint32_t  MISC_CONF;   // 0x44
  volatile uint32_t  MEM_CONF;    // 0x48
           uint32_t  _pad[(0x80 - 0x4C) / 4];
  volatile uint32_t  DATE;        // 0x80
//
} esp_usb_serial_jtag_t;

#define USB_SERIAL_JTAG  ((esp_usb_serial_jtag_t *)(DR_REG_USB_SERIAL_JTAG_BASE))

//-----------------------------------------------------------------------------
// GDMA
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  RAW;
  volatile uint32_t  ST;
  volatile uint32_t  ENA;
  volatile uint32_t  CLR;
//
} esp_dmach_intr_t;

typedef struct
{
  volatile uint32_t  CONF0;              // 0x070
  volatile uint32_t  CONF1;              // 0x074
  volatile uint32_t  FIFO_STATUS;        // 0x078
  volatile uint32_t  POP_PUSH;           // 0x07C
  volatile uint32_t  LINK;               // 0x080
  volatile uint32_t  STATE;              // 0x084
  volatile uint32_t  SUC_EOF_DES_ADDR;   // 0x088  OUT name: EOF_DES_ADDR
  volatile uint32_t  ERR_EOF_DES_ADDR;   // 0x08C  OUT name: EOF_BFR_DES_ADDR
  volatile uint32_t  DSCR;               // 0x090
  volatile uint32_t  DSCR_BF0;           // 0x094
  volatile uint32_t  DSCR_BF1;           // 0x098
  volatile uint32_t  PRI;                // 0x09C
  volatile uint32_t  PERI_SEL;           // 0x0A0
           uint32_t  _pad[11];
//
} esp_dmainout_t;

typedef struct
{
  esp_dmainout_t     IN;
  esp_dmainout_t     OUT;
//
} esp_dmach_t;

typedef struct
{
  esp_dmach_intr_t      INTR[3];          // 0x000 - 0x030

  uint32_t  _pad_030[(0x40 - 0x30) / 4];  // 0x030

  volatile uint32_t     AHB_TEST;         // 0x040
  volatile uint32_t     MISC_CONF;        // 0x044
  volatile uint32_t     DATE;             // 0x048

  uint32_t  _pad_04C[(0x70 - 0x4C) / 4];  // 0x04C

  esp_dmach_t           CH[3];            // 0x070
//
} esp_gdma_t;

#define GDMA  ((esp_gdma_t *)(DR_REG_GDMA_BASE))

#define GDMA_PERI_SEL_SPI2     0
#define GDMA_PERI_SEL_UHCI0    2
#define GDMA_PERI_SEL_I2S      3
#define GDMA_PERI_SEL_AES      6
#define GDMA_PERI_SEL_SHA      7
#define GDMA_PERI_SEL_ADC      8
#define GDMA_PERI_SEL_PARLIO0  9

#define GDMA_MAX_CHANNELS    3

typedef struct
{
  uint32_t   size_len_flags;
  uint32_t   bufaddr;
  uint32_t   next_desc;
//
} esp_dmadesc_t;

#define DMADESC_FLAG_OWN      (1u << 31)
#define DMADESC_FLAG_SUC_EOF  (1u << 30)
#define DMADESC_FLAG_ERR_EOF  (1u << 28)
#define DMADESC_SIZE_POS       0
#define DMADESC_LEN_POS       12

//-----------------------------------------------------------------------------
// I2C
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  SCL_LOW_PERIOD;          // 0x00
  volatile uint32_t  CTR;                     // 0x04
  volatile uint32_t  SR;                      // 0x08
  volatile uint32_t  TO;                      // 0x0C
  volatile uint32_t  SLAVE_ADDR;              // 0x10
  volatile uint32_t  FIFO_ST;                 // 0x14
  volatile uint32_t  FIFO_CONF;               // 0x18
  volatile uint32_t  DATA;                    // 0x1C
  volatile uint32_t  INT_RAW;                 // 0x20
  volatile uint32_t  INT_CLR;                 // 0x24
  volatile uint32_t  INT_ENA;                 // 0x28
  volatile uint32_t  INT_STATUS;              // 0x2C
  volatile uint32_t  SDA_HOLD;                // 0x30
  volatile uint32_t  SDA_SAMPLE;              // 0x34
  volatile uint32_t  SCL_HIGH_PERIOD;         // 0x38
           uint32_t  _pad_3C;                 // 0x3C
  volatile uint32_t  SCL_START_HOLD;          // 0x40
  volatile uint32_t  SCL_RSTART_SETUP;        // 0x44
  volatile uint32_t  SCL_STOP_HOLD;           // 0x48
  volatile uint32_t  SCL_STOP_SETUP;          // 0x4C
  volatile uint32_t  FILTER_CFG;              // 0x50
  volatile uint32_t  CLK_CONF;                // 0x54
  volatile uint32_t  COMD[8];                 // 0x58 - 0x78
  volatile uint32_t  SCL_ST_TIME_OUT;         // 0x78
  volatile uint32_t  SCL_MAIN_ST_TIME_OUT;    // 0x7C
  volatile uint32_t  SCL_SP_CONF;             // 0x80
  volatile uint32_t  SCL_STRETCH_CONF;        // 0x84
           uint32_t  _pad_88[(0xF8-0x88)/4];  // 0x88
  volatile uint32_t  DATE;                    // 0xF8
           uint32_t  _pad_FC;                 // 0xFC
  volatile uint32_t  TXFIFO_START_ADDR[32];   // 0x100
  volatile uint32_t  RXFIFO_START_ADDR[32];   // 0x180
//
} esp_i2c_regs_t;

#if 1
  // definition check:
  static_assert(offsetof(esp_i2c_regs_t, TXFIFO_START_ADDR)  == 0x100, "offset error");
  static_assert(offsetof(esp_i2c_regs_t, RXFIFO_START_ADDR)  == 0x180, "offset error");
#endif

#define I2C0  ((esp_i2c_regs_t *)(DR_REG_I2C_EXT_BASE))

