nvitya/vihal/rv32i/ESP/32C6/esp32c6_vihal.h
//-----------------------------------------------------------------------------
// TWAI = CAN
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  MODE;                 // 00
  volatile uint32_t  CMD;                  // 04
  volatile uint32_t  STATUS;               // 08
  volatile uint32_t  INT_RAW;              // 0C
  volatile uint32_t  INT_ENA;              // 10
  volatile uint32_t  _pad_14;              // 14
  volatile uint32_t  BUS_TIMING_0;         // 18
  volatile uint32_t  BUS_TIMING_1;         // 1C
  uint32_t  _pad_20[(0x2C-0x20)/4];        // 20
  volatile uint32_t  ARB_LOST_CAP;         // 2C
  volatile uint32_t  ERR_CODE_CAP;         // 30
  volatile uint32_t  ERR_WARNING_LIMIT;    // 34
  volatile uint32_t  RX_ERR_CNT;           // 38
  volatile uint32_t  TX_ERR_CNT;           // 3C

  volatile uint32_t  DATA[13];             // 40 - 74

  volatile uint32_t  RX_MESSAGE_CNT;       // 74
           uint32_t  _pad_78;              // 78
  volatile uint32_t  CLOCK_DIVIDER;        // 7C
//
} esp_twai_regs_t;

#if 1
  // definition check:
  static_assert(offsetof(esp_twai_regs_t, CLOCK_DIVIDER)  == 0x7C, "offset error");
#endif

#define TWAI0  ((esp_twai_regs_t *)(DR_REG_TWAI0_BASE))
#define TWAI1  ((esp_twai_regs_t *)(DR_REG_TWAI1_BASE))

//-----------------------------------------------------------------------------
// SARADC
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  CTRL;                 // 0x000
  volatile uint32_t  CTRL2;                // 0x004
  volatile uint32_t  FILTER_CTRL1;         // 0x008
  volatile uint32_t  FSM_WAIT;             // 0x00C
  volatile uint32_t  SAR1_STATUS;          // 0x010
  volatile uint32_t  SAR2_STATUS;          // 0x014
  volatile uint32_t  SAR_PATT_TAB1;        // 0x018
  volatile uint32_t  SAR_PATT_TAB2;        // 0x01C
  volatile uint32_t  ONETIME_SAMPLE;       // 0x020
  volatile uint32_t  APB_ADC_ARB_CTRL;     // 0x024
  volatile uint32_t  FILTER_CTRL0;         // 0x028
  volatile uint32_t  DATA_STATUS_1;        // 0x02C  (APB_SARADC_1_DATA_STATUS_REG)
  volatile uint32_t  DATA_STATUS_2;        // 0x030  (APB_SARADC_2_DATA_STATUS_REG)
  volatile uint32_t  THRES0_CTRL;          // 0x034
  volatile uint32_t  THRES1_CTRL;          // 0x038
  volatile uint32_t  THRES_CTRL;           // 0x03C
  volatile uint32_t  INT_ENA;              // 0x040
  volatile uint32_t  INT_RAW;              // 0x044
  volatile uint32_t  INT_ST;               // 0x048
  volatile uint32_t  INT_CLR;              // 0x04C
  volatile uint32_t  DMA_CONF;             // 0x050
  volatile uint32_t  APB_ADC_CLKM_CONF;    // 0x054
  volatile uint32_t  APB_TSENS_CTRL;       // 0x058
  volatile uint32_t  APB_TSENS_CTRL2;      // 0x05C
  volatile uint32_t  CALI;                 // 0x060
  uint32_t  _pad_064[(0x3FC-0x64)/4];      // 0x064
  volatile uint32_t  APB_CTRL_DATE;        // 0x3FC
//
} esp_saradc_regs_t;

#define SARADC  ((esp_saradc_regs_t *)(DR_REG_APB_SARADC_BASE))

//-----------------------------------------------------------------------------
// LEDC / LED PWM
//-----------------------------------------------------------------------------

typedef struct
{
  volatile uint32_t  LSCH0_CONF0;      // 0x00
  volatile uint32_t  LSCH0_HPOINT;     // 0x04
  volatile uint32_t  LSCH0_DUTY;       // 0x08
  volatile uint32_t  LSCH0_CONF1;      // 0x0C
  volatile uint32_t  LSCH0_DUTY_R;     // 0x10
  volatile uint32_t  LSCH1_CONF0;      // 0x14
  volatile uint32_t  LSCH1_HPOINT;     // 0x18
  volatile uint32_t  LSCH1_DUTY;       // 0x1C
  volatile uint32_t  LSCH1_CONF1;      // 0x20
  volatile uint32_t  LSCH1_DUTY_R;     // 0x24
  volatile uint32_t  LSCH2_CONF0;      // 0x28
  volatile uint32_t  LSCH2_HPOINT;     // 0x2C
  volatile uint32_t  LSCH2_DUTY;       // 0x30
  volatile uint32_t  LSCH2_CONF1;      // 0x34
  volatile uint32_t  LSCH2_DUTY_R;     // 0x38
  volatile uint32_t  LSCH3_CONF0;      // 0x3C
  volatile uint32_t  LSCH3_HPOINT;     // 0x40
  volatile uint32_t  LSCH3_DUTY;       // 0x44
  volatile uint32_t  LSCH3_CONF1;      // 0x48
  volatile uint32_t  LSCH3_DUTY_R;     // 0x4C
  volatile uint32_t  LSCH4_CONF0;      // 0x50
  volatile uint32_t  LSCH4_HPOINT;     // 0x54
  volatile uint32_t  LSCH4_DUTY;       // 0x58
  volatile uint32_t  LSCH4_CONF1;      // 0x5C
  volatile uint32_t  LSCH4_DUTY_R;     // 0x60
  volatile uint32_t  LSCH5_CONF0;      // 0x64
  volatile uint32_t  LSCH5_HPOINT;     // 0x68
  volatile uint32_t  LSCH5_DUTY;       // 0x6C
  volatile uint32_t  LSCH5_CONF1;      // 0x70
  volatile uint32_t  LSCH5_DUTY_R;     // 0x74
  uint32_t  _pad_78[(0xA0-0x78)/4];    // 0x78
  volatile uint32_t  LSTIMER0_CONF;    // 0xA0
  volatile uint32_t  LSTIMER0_VALUE;   // 0xA4
  volatile uint32_t  LSTIMER1_CONF;    // 0xA8
  volatile uint32_t  LSTIMER1_VALUE;   // 0xAC
  volatile uint32_t  LSTIMER2_CONF;    // 0xB0
  volatile uint32_t  LSTIMER2_VALUE;   // 0xB4
  volatile uint32_t  LSTIMER3_CONF;    // 0xB8
  volatile uint32_t  LSTIMER3_VALUE;   // 0xBC
  volatile uint32_t  INT_RAW;          // 0xC0
  volatile uint32_t  INT_ST;           // 0xC4
  volatile uint32_t  INT_ENA;          // 0xC8
  volatile uint32_t  INT_CLR;          // 0xCC
  volatile uint32_t  CONF;             // 0xD0
  uint32_t  _pad_D4[(0xFC-0xD4)/4];    // 0xD4
  volatile uint32_t  DATE;             // 0xFC
//
} esp_ledc_regs_t;

#define LEDC  ((esp_ledc_regs_t *)(DR_REG_LEDC_BASE))





//-----------------------------------------------------------------------------
// Miscellaneous
//-----------------------------------------------------------------------------

typedef struct
{
    uint8_t   magic;             // Magic word ESP_IMAGE_HEADER_MAGIC = 0xE9
    uint8_t   segment_count;     // Count of memory segments
    uint8_t   spi_mode;          // flash read mode, 2 = DIO
    uint8_t   spi_speed_size;    // low 4 bits: speed, 0 = 40 MHz;  high 4 bits: size, 2 = 4MB
    uint32_t  entry_addr;        // Entry address
    uint8_t   wp_pin;            // 0xEE = disabled
    uint8_t   spi_pin_drv[3];    // Drive settings for the SPI flash pins (read by ROM bootloader)
    uint16_t  chip_id;           // Chip identification number, 0x0005 = ESP32c3
    uint8_t   min_chip_rev;      // Minimum chip revision supported by image
    uint8_t   reserved[8];       // Reserved bytes in additional header space, currently unused
    uint8_t   hash_appended;     // If 1, a SHA256 digest "simple hash" (of the entire image) is appended after the checksum.
    // first segment
    uint32_t  load_addr;         // load address of the first segment
    uint32_t  data_len;          // size of the first segment
//
} vihal_esp_image_header_t;

// a valid (second stage bootloader) example at flash address 0:
//   E9 03 02 20 00 E0 3C 40 EE 00 00 00 05 00 00 00
//   00 00 00 00 00 00 00 00 00 61 CD 3F 8C 03 00 00

#endif // ifndef _ESP32C6_VIHAL_H
